run/StraightChannel/power_law/SC_PL_myOhmic/0/sigma.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type            fixedValue;
	value           uniform 0.0341;
    }
    
    outlet
    {
	type            zeroGradient;      
    }
    
    symmetry
    {
	type            zeroGradient;    
    }
    
    walls
    {
	type            zeroGradient;     
    }
    

    frontAndBack
    {
	type            empty;   
    }
}

// ************************************************************************* //
